{"calcium_addit": 0, "chang": 1, "resist": 2, "altern": 3, "rate": 4, "exact": 5, "temperatur": 6, "sio2": 7, "california": 8, "lime": 9, "format": 10, "2h": 11, "construct": 12, "durabl": 13, "make": 14, "smoother": 15, "coat": 16, "present": 17, "ph": 18, "it": 19, "raise_ph": 20, "benefici": 21, "includ": 22, "dioxid": 23, "microbi": 24, "silicon": 25, "fluctuat": 26, "powderi": 27, "mechan": 28, "ceram": 29, "build": 30, "capabl": 31, "plastic": 32, "mexico": 33, "improv": 34, "bicarbon": 35, "basic": 36, "what": 37, "subject": 38, "hco\u2083": 39, "ca": 40, "below": 41, "paint": 42, "co2": 43, "solut": 44, "sourc": 45, "state": 46, "safe": 47, "china": 48, "asbesto": 49, "sio\u2082": 50, "than": 51, "silic": 52, "agricultur": 53, "provid": 54, "through": 55, "caco\u2083": 56, "rubber": 57, "where": 58, "react": 59, "materi": 60, "strength": 61, "carbon": 62, "casio\u2083": 63, "how": 64, "mildew": 65, "turn": 66, "contain": 67, "co\u2082": 68, "now": 69, "h2o": 70, "plant": 71, "metamorph": 72, "silica": 73, "2co\u2082": 74, "new": 75, "industri": 76, "strengthen": 77, "dissolut": 78, "ad": 79, "mine": 80, "fulli": 81, "area": 82, "onli": 83, "unstabl": 84, "h4sio4": 85, "buffer": 86, "influenc": 87, "pressur": 88, "applic": 89, "fair": 90, "high": 91, "down": 92, "surround": 93, "rapid": 94, "chemic": 95, "more": 96, "silicon_addit": 97, "limeston": 98, "miner": 99, "slowli": 100, "reaction": 101, "cost": 102, "absorb": 103, "contribut": 104, "finland": 105, "suppress": 106, "control": 107, "water": 108, "h\u2082o": 109, "which": 110, "given": 111, "unit": 112, "reinforc": 113, "offer": 114, "activ": 115, "soil": 116, "decompos": 117, "caco3": 118, "wollastonit": 119, "formula": 120, "from": 121, "ion": 122, "dure": 123, "although": 124, "grower": 125, "slower": 126, "origin": 127, "agent": 128, "root": 129, "form": 130, "understood": 131, "against": 132, "canada": 133, "easili": 134, "effect": 135, "2h2o": 136, "other": 137, "casio3": 138, "calcium": 139, "india": 140, "process": 141, "heat": 142, "ca2": 143, "produc": 144, "level": 145, "largest": 146, "buffer_ph": 147, "when": 148, "content": 149, "break": 150, "york": 151, "impact": 152, "acid": 153, "hydrogen": 154, "si": 155, "pest": 156}