{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# The Start\n",
    "In this notebook, I walk through building and retrieving from a neo4j knowledge graph.\n",
    "\n",
    "I start with the same text_nodes used to build the vector index. This way the results can be combined and reranked to improve the quality of the retrieval results.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "c:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\IPython\\core\\magics\\osm.py:417: UserWarning: This is now an optional IPython functionality, setting dhist requires you to install the `pickleshare` library.\n",
      "  self.shell.db['dhist'] = compress_dhist(dhist)[-100:]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'c:\\\\Users\\\\happy\\\\Documents\\\\Projects\\\\askgrowbuddy'"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# This notebook is in the eval folder.  Change to the root folder.\n",
    "%cd ..\n",
    "%pwd  # To verify the current working directory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "resource module not available on Windows\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<pre style=\"white-space:pre;overflow-x:auto;line-height:normal;font-family:Menlo,'DejaVu Sans Mono',consolas,'Courier New',monospace\"><span style=\"font-style: italic\">                                          Document Statistics                                           </span>\n",
       "┏━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n",
       "┃<span style=\"font-weight: bold\"> Statistic              </span>┃<span style=\"font-weight: bold\"> Value                                                                       </span>┃\n",
       "┡━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Document Type          </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> Document                                                                    </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Total Documents        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 3                                                                           </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Avg Content Length     </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 19989.7                                                                     </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> All Docs Have Content  </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> True                                                                        </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> All Docs Have Metadata </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> True                                                                        </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Shortest Doc Length    </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 57                                                                          </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Longest Doc Length     </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 52741                                                                       </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Metadata Fields        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> </span><span style=\"color: #800080; text-decoration-color: #800080; font-style: italic\">                              Metadata Fields                              </span><span style=\"color: #800080; text-decoration-color: #800080\"> </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> ┏━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> ┃</span><span style=\"color: #800080; text-decoration-color: #800080; font-weight: bold\"> Field              </span><span style=\"color: #800080; text-decoration-color: #800080\">┃</span><span style=\"color: #800080; text-decoration-color: #800080; font-weight: bold\"> Unique Values                                      </span><span style=\"color: #800080; text-decoration-color: #800080\">┃ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> ┡━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> audio_quality      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> small                                              </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> audio_source       </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> https://www.youtube.com/watch?v=SfDKCqfALSw        </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> channel            </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> e-GRO Webinars                                     </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> compute_type       </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> int8                                               </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> created            </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 1730154484.551, 1730154515.18, 1730319609.586      </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> description        </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> In this e-GRO Webinar Patrick Veazie and Dr. Br... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> download_time      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 00:00:15                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> duration           </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 00:07:33                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> last_accessed      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 1730154484.551, 1730154515.18, 1730319609.586      </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> last_modified      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 1708293723.919, 1724271611.782, 1729979061.458     </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> path               </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> G:\\My Drive\\Audios_To_Knowledge\\knowledge\\AskGr... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> source             </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> Focusing on Calcium Nutrition.md, ph.md, soil s... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> tags               </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\">                                                    </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> title              </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> Focusing on Calcium Nutrition                      </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> transcription_time </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 00:00:31                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> upload_date        </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 20240821                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> uploader_id        </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> @e-growebinars487                                  </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> └────────────────────┴────────────────────────────────────────────────────┘ </span>│\n",
       "└────────────────────────┴─────────────────────────────────────────────────────────────────────────────┘\n",
       "</pre>\n"
      ],
      "text/plain": [
       "\u001b[3m                                          Document Statistics                                           \u001b[0m\n",
       "┏━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n",
       "┃\u001b[1m \u001b[0m\u001b[1mStatistic             \u001b[0m\u001b[1m \u001b[0m┃\u001b[1m \u001b[0m\u001b[1mValue                                                                      \u001b[0m\u001b[1m \u001b[0m┃\n",
       "┡━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩\n",
       "│\u001b[36m \u001b[0m\u001b[36mDocument Type         \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35mDocument                                                                   \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mTotal Documents       \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m3                                                                          \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mAvg Content Length    \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m19989.7                                                                    \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mAll Docs Have Content \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35mTrue                                                                       \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mAll Docs Have Metadata\u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35mTrue                                                                       \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mShortest Doc Length   \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m57                                                                         \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mLongest Doc Length    \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m52741                                                                      \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mMetadata Fields       \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[3;35m                              Metadata Fields                              \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m┏━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m┃\u001b[0m\u001b[1;35m \u001b[0m\u001b[1;35mField             \u001b[0m\u001b[1;35m \u001b[0m\u001b[35m┃\u001b[0m\u001b[1;35m \u001b[0m\u001b[1;35mUnique Values                                     \u001b[0m\u001b[1;35m \u001b[0m\u001b[35m┃\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m┡━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36maudio_quality     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32msmall                                             \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36maudio_source      \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mhttps://www.youtube.com/watch?v=SfDKCqfALSw       \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mchannel           \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32me-GRO Webinars                                    \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mcompute_type      \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mint8                                              \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mcreated           \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m1730154484.551, 1730154515.18, 1730319609.586     \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mdescription       \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mIn this e-GRO Webinar Patrick Veazie and Dr. Br...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mdownload_time     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m00:00:15                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mduration          \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m00:07:33                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mlast_accessed     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m1730154484.551, 1730154515.18, 1730319609.586     \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mlast_modified     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m1708293723.919, 1724271611.782, 1729979061.458    \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mpath              \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mG:\\My Drive\\Audios_To_Knowledge\\knowledge\\AskGr...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36msource            \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mFocusing on Calcium Nutrition.md, ph.md, soil s...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mtags              \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m                                                  \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mtitle             \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mFocusing on Calcium Nutrition                     \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mtranscription_time\u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m00:00:31                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mupload_date       \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m20240821                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36muploader_id       \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m@e-growebinars487                                 \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m└────────────────────┴────────────────────────────────────────────────────┘\u001b[0m\u001b[35m \u001b[0m│\n",
       "└────────────────────────┴─────────────────────────────────────────────────────────────────────────────┘\n"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "{'Document Type': 'Document',\n",
       " 'Total Documents': 3,\n",
       " 'Avg Content Length': '19989.7',\n",
       " 'All Docs Have Content': True,\n",
       " 'All Docs Have Metadata': True,\n",
       " 'Shortest Doc Length': 57,\n",
       " 'Longest Doc Length': 52741}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# --->: Read in the markdown files in the Obsidian vault directory\n",
    "from src.ingest_service import IngestService\n",
    "from src.doc_stats import DocStats\n",
    "# The Directory containing the knowledge documents used by the AI to do the analysis on the soil tests.\n",
    "soil_knowledge_directory = r\"G:\\My Drive\\Audios_To_Knowledge\\knowledge\\AskGrowBuddy\\AskGrowBuddy\\Knowledge\\soil_test_knowlege\\test\"\n",
    "# Load the documents\n",
    "ingest_service = IngestService()\n",
    "loaded_documents = ingest_service.load_obsidian_notes(soil_knowledge_directory)\n",
    "# Show some summary stats about the documents\n",
    "\n",
    "DocStats.print_llama_index_docs_summary_stats(loaded_documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<pre style=\"white-space:pre;overflow-x:auto;line-height:normal;font-family:Menlo,'DejaVu Sans Mono',consolas,'Courier New',monospace\"><span style=\"font-style: italic\">                                          Document Statistics                                           </span>\n",
       "┏━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n",
       "┃<span style=\"font-weight: bold\"> Statistic              </span>┃<span style=\"font-weight: bold\"> Value                                                                       </span>┃\n",
       "┡━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Document Type          </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> TextNode                                                                    </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Total Documents        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 35                                                                          </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Avg Content Length     </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 1710.5                                                                      </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> All Docs Have Content  </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> True                                                                        </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> All Docs Have Metadata </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> True                                                                        </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Shortest Doc Length    </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 58                                                                          </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Longest Doc Length     </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> 7159                                                                        </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\"> Metadata Fields        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> </span><span style=\"color: #800080; text-decoration-color: #800080; font-style: italic\">                              Metadata Fields                              </span><span style=\"color: #800080; text-decoration-color: #800080\"> </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> ┏━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> ┃</span><span style=\"color: #800080; text-decoration-color: #800080; font-weight: bold\"> Field              </span><span style=\"color: #800080; text-decoration-color: #800080\">┃</span><span style=\"color: #800080; text-decoration-color: #800080; font-weight: bold\"> Unique Values                                      </span><span style=\"color: #800080; text-decoration-color: #800080\">┃ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> ┡━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> Header 1           </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> About Compost, About SOM, About Soil Health, Ab... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> audio_quality      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> small                                              </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> audio_source       </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> https://www.youtube.com/watch?v=SfDKCqfALSw        </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> channel            </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> e-GRO Webinars                                     </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> compute_type       </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> int8                                               </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> created            </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 1730154484.551, 1730154515.18, 1730319609.586      </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> description        </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> In this e-GRO Webinar Patrick Veazie and Dr. Br... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> download_time      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 00:00:15                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> duration           </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 00:07:33                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> last_accessed      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 1730154484.551, 1730154515.18, 1730319609.586      </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> last_modified      </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 1708293723.919, 1724271611.782, 1729979061.458     </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> path               </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> G:\\My Drive\\Audios_To_Knowledge\\knowledge\\AskGr... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> source             </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> Focusing on Calcium Nutrition.md, ph.md, soil s... </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> tags               </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\">                                                    </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> title              </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> Focusing on Calcium Nutrition                      </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> transcription_time </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 00:00:31                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> upload_date        </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> 20240821                                           </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> │</span><span style=\"color: #008080; text-decoration-color: #008080\"> uploader_id        </span><span style=\"color: #800080; text-decoration-color: #800080\">│</span><span style=\"color: #008000; text-decoration-color: #008000\"> @e-growebinars487                                  </span><span style=\"color: #800080; text-decoration-color: #800080\">│ </span>│\n",
       "│<span style=\"color: #008080; text-decoration-color: #008080\">                        </span>│<span style=\"color: #800080; text-decoration-color: #800080\"> └────────────────────┴────────────────────────────────────────────────────┘ </span>│\n",
       "└────────────────────────┴─────────────────────────────────────────────────────────────────────────────┘\n",
       "</pre>\n"
      ],
      "text/plain": [
       "\u001b[3m                                          Document Statistics                                           \u001b[0m\n",
       "┏━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n",
       "┃\u001b[1m \u001b[0m\u001b[1mStatistic             \u001b[0m\u001b[1m \u001b[0m┃\u001b[1m \u001b[0m\u001b[1mValue                                                                      \u001b[0m\u001b[1m \u001b[0m┃\n",
       "┡━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩\n",
       "│\u001b[36m \u001b[0m\u001b[36mDocument Type         \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35mTextNode                                                                   \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mTotal Documents       \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m35                                                                         \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mAvg Content Length    \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m1710.5                                                                     \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mAll Docs Have Content \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35mTrue                                                                       \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mAll Docs Have Metadata\u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35mTrue                                                                       \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mShortest Doc Length   \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m58                                                                         \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mLongest Doc Length    \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[35m7159                                                                       \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m \u001b[0m\u001b[36mMetadata Fields       \u001b[0m\u001b[36m \u001b[0m│\u001b[35m \u001b[0m\u001b[3;35m                              Metadata Fields                              \u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m┏━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m┃\u001b[0m\u001b[1;35m \u001b[0m\u001b[1;35mField             \u001b[0m\u001b[1;35m \u001b[0m\u001b[35m┃\u001b[0m\u001b[1;35m \u001b[0m\u001b[1;35mUnique Values                                     \u001b[0m\u001b[1;35m \u001b[0m\u001b[35m┃\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m┡━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┩\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mHeader 1          \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mAbout Compost, About SOM, About Soil Health, Ab...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36maudio_quality     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32msmall                                             \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36maudio_source      \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mhttps://www.youtube.com/watch?v=SfDKCqfALSw       \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mchannel           \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32me-GRO Webinars                                    \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mcompute_type      \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mint8                                              \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mcreated           \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m1730154484.551, 1730154515.18, 1730319609.586     \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mdescription       \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mIn this e-GRO Webinar Patrick Veazie and Dr. Br...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mdownload_time     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m00:00:15                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mduration          \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m00:07:33                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mlast_accessed     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m1730154484.551, 1730154515.18, 1730319609.586     \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mlast_modified     \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m1708293723.919, 1724271611.782, 1729979061.458    \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mpath              \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mG:\\My Drive\\Audios_To_Knowledge\\knowledge\\AskGr...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36msource            \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mFocusing on Calcium Nutrition.md, ph.md, soil s...\u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mtags              \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m                                                  \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mtitle             \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32mFocusing on Calcium Nutrition                     \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mtranscription_time\u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m00:00:31                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36mupload_date       \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m20240821                                          \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m│\u001b[0m\u001b[36m \u001b[0m\u001b[36muploader_id       \u001b[0m\u001b[36m \u001b[0m\u001b[35m│\u001b[0m\u001b[32m \u001b[0m\u001b[32m@e-growebinars487                                 \u001b[0m\u001b[32m \u001b[0m\u001b[35m│\u001b[0m\u001b[35m \u001b[0m│\n",
       "│\u001b[36m                        \u001b[0m│\u001b[35m \u001b[0m\u001b[35m└────────────────────┴────────────────────────────────────────────────────┘\u001b[0m\u001b[35m \u001b[0m│\n",
       "└────────────────────────┴─────────────────────────────────────────────────────────────────────────────┘\n"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "{'Document Type': 'TextNode',\n",
       " 'Total Documents': 35,\n",
       " 'Avg Content Length': '1710.5',\n",
       " 'All Docs Have Content': True,\n",
       " 'All Docs Have Metadata': True,\n",
       " 'Shortest Doc Length': 58,\n",
       " 'Longest Doc Length': 7159}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "text_nodes = ingest_service.chunk_text(loaded_documents)\n",
    "DocStats.print_llama_index_docs_summary_stats(text_nodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "def check_disconnected_entities(session):\n",
    "    query = \"\"\"\n",
    "    MATCH (e:Entity)\n",
    "    WHERE NOT (e)<-[:CONTAINS]-(:TextNode)\n",
    "    RETURN e.name as entity\n",
    "    \"\"\"\n",
    "    result = session.run(query)\n",
    "    disconnected = [record[\"entity\"] for record in result]\n",
    "    print(f\"Found {len(disconnected)} disconnected entities:\")\n",
    "    for entity in disconnected:\n",
    "        print(f\"- {entity}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def retrieve_from_knowledge_graph(search_term: str, k: int = 5):\n",
    "    \"\"\"\n",
    "    Retrieve top k most relevant nodes based on graph relationships.\n",
    "    Uses relationship patterns and connection density to rank relevance.\n",
    "\n",
    "    Args:\n",
    "        search_term: Search term/concept\n",
    "        k: Number of results to return\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"asd@123qwe\"))\n",
    "\n",
    "    try:\n",
    "        with driver.session(database=\"soiltestknowledge\") as session:\n",
    "            # Find nodes and their relationship counts, ordered by connectivity\n",
    "            result = session.run(\"\"\"\n",
    "                MATCH (start:Entity)\n",
    "                WHERE start.name CONTAINS $search_term\n",
    "                WITH start\n",
    "                MATCH (start)-[r]-(connected)\n",
    "                WITH start, connected, count(r) as rel_count\n",
    "                RETURN DISTINCT start.name as entity,\n",
    "                       collect(connected.name) as connected_entities,\n",
    "                       count(connected) as connection_count\n",
    "                ORDER BY connection_count DESC\n",
    "                LIMIT $k\n",
    "            \"\"\",\n",
    "            search_term=search_term.lower(),\n",
    "            k=k\n",
    "            )\n",
    "\n",
    "            return [(record[\"entity\"],\n",
    "                    record[\"connected_entities\"],\n",
    "                    record[\"connection_count\"])\n",
    "                    for record in result]\n",
    "    finally:\n",
    "        driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "from src.ask_question import ask_question\n",
    "def get_search_terms_prompt(text: str, max_terms: int = 5) -> str:\n",
    "    \"\"\"Returns prompt template for extracting search terms from a query.\"\"\"\n",
    "    return f\"\"\"Extract ONLY the most specific technical terms from the query. Maximum {max_terms} terms.\n",
    "\n",
    "STRICT RULES - YOU MUST FOLLOW THESE:\n",
    "1. ONLY INCLUDE:\n",
    "   - Words that are in the query\n",
    "   - Technical measurements (pH, EC, PPM, meq)\n",
    "   - Chemical names (N, P, K, calcium, magnesium)\n",
    "   - Specific soil properties (CEC, bulk density)\n",
    "   - Technical conditions (anaerobic, aerobic)\n",
    "\n",
    "2. NEVER INCLUDE:\n",
    "   - Words that are not in the query\n",
    "   - The word 'cannabis' or 'marijuana'\n",
    "   - The word 'plant' or 'plants'\n",
    "   - The word 'soil' by itself\n",
    "   - The word 'ideal' or 'optimal'\n",
    "   - The word 'good' or 'best'\n",
    "   - The word 'grow' or 'growing'\n",
    "   - Any other generic descriptors\n",
    "\n",
    "If no technical terms are found, return EMPTY string.\n",
    "Return only comma-separated terms, no explanations.\n",
    "\n",
    "Examples:\n",
    "Query: What's the ideal pH range for cannabis in soil?\n",
    "Terms: pH\n",
    "\n",
    "Query: What are options for Calcium nutrients?\n",
    "Terms: calcium, nutrients\n",
    "\n",
    "Query: How to fix nitrogen deficiency in plants?\n",
    "Terms: nitrogen, deficiency\n",
    "\n",
    "Query: {text}\n",
    "Terms:\"\"\"\n",
    "\n",
    "def extract_search_terms_llm(query: str, max_terms: int = 5, model_name: str = 'mistral_soil') -> list[str]:\n",
    "    \"\"\"Uses LLM to extract key search terms from query.\"\"\"\n",
    "    prompt = get_search_terms_prompt(query, max_terms)\n",
    "    response = ask_question(prompt.format(text=query), model_name=model_name)\n",
    "    # Convert response to lowercase for comparison\n",
    "    query_lower = query.lower()\n",
    "\n",
    "    # Only accept terms that actually appear in the query\n",
    "    terms = [term.strip() for term in response['answer'].split(',') if term.strip()]\n",
    "    valid_terms = [term for term in terms if term.lower() in query_lower]\n",
    "\n",
    "    return valid_terms\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "LLM: ['magnesium', 'nutrients']\n"
     ]
    }
   ],
   "source": [
    "query = \"What magnesium nutrients do you recommend?\"\n",
    "valid_terms = extract_search_terms_llm(query)\n",
    "print(\"LLM:\", valid_terms)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from llama_index.core.schema import NodeWithScore, TextNode, MetadataMode\n",
    "\n",
    "def retrieve_from_knowledge_graph(search_terms: list[str], k: int = 5, max_score: float = 0.95):\n",
    "    \"\"\"\n",
    "    Retrieve top k most relevant nodes based on graph relationships.\n",
    "    Returns list of NodeWithScore objects with text and metadata from Neo4j.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"asd@123qwe\"))\n",
    "\n",
    "    try:\n",
    "        with driver.session(database=\"soiltestknowledge\") as session:  # Check your database name!\n",
    "            # Debug: First check if we can find the entities\n",
    "            print(\"Searching for entities...\")\n",
    "            scoring_result = session.run(\"\"\"\n",
    "                MATCH (start:Entity)\n",
    "                WHERE any(term IN $terms WHERE toLower(start.name) CONTAINS toLower(term))\n",
    "                RETURN start.name as entity\n",
    "            \"\"\",\n",
    "            terms=search_terms\n",
    "            )\n",
    "\n",
    "            entities = [record[\"entity\"] for record in scoring_result]\n",
    "            print(f\"Found entities: {entities}\")\n",
    "\n",
    "            if not entities:\n",
    "                print(\"No matching entities found!\")\n",
    "                return []\n",
    "\n",
    "            # Now get scores for found entities\n",
    "            scoring_result = session.run(\"\"\"\n",
    "                MATCH (start:Entity)\n",
    "                WHERE start.name IN $entities\n",
    "\n",
    "                OPTIONAL MATCH (start)-[r]-(connected:Entity)\n",
    "                WHERE type(r) <> 'CONTAINS' AND type(r) <> 'MENTIONED_IN'\n",
    "\n",
    "                WITH start.name as entity,\n",
    "                     count(DISTINCT connected) as conn_count\n",
    "                WITH collect({entity: entity, count: conn_count}) as results,\n",
    "                     max(conn_count) as max_count\n",
    "                WHERE max_count > 0\n",
    "\n",
    "                UNWIND results as result\n",
    "                RETURN\n",
    "                    result.entity as entity,\n",
    "                    toFloat(result.count) / toFloat(max_count) * $max_score as score\n",
    "                ORDER BY score DESC\n",
    "                LIMIT $k\n",
    "            \"\"\",\n",
    "            entities=entities,\n",
    "            max_score=max_score,\n",
    "            k=k\n",
    "            )\n",
    "\n",
    "            scored_entities = [(record[\"entity\"], record[\"score\"]) for record in scoring_result]\n",
    "            print(f\"Scored entities: {scored_entities}\")\n",
    "\n",
    "            # Get content for scored entities\n",
    "            nodes_with_scores = []\n",
    "            for entity, score in scored_entities:\n",
    "                print(f\"\\nFetching content for {entity}\")\n",
    "                content_result = session.run(\"\"\"\n",
    "                    MATCH (e:Entity {name: $entity})<-[:CONTAINS]-(text:TextNode)\n",
    "                    RETURN\n",
    "                        text.text as text,\n",
    "                        text.metadata as metadata,\n",
    "                        text.source as source\n",
    "                    LIMIT 1\n",
    "                \"\"\",\n",
    "                entity=entity\n",
    "                )\n",
    "\n",
    "                data = content_result.single()\n",
    "                if data is None:\n",
    "                    print(f\"No TextNode found for {entity}\")\n",
    "                    continue\n",
    "\n",
    "                # Get connections in separate query\n",
    "                connections_result = session.run(\"\"\"\n",
    "                    MATCH (e:Entity {name: $entity})-[r]-(connected:Entity)\n",
    "                    WHERE type(r) <> 'CONTAINS' AND type(r) <> 'MENTIONED_IN'\n",
    "                    RETURN collect(DISTINCT {\n",
    "                        entity: connected.name,\n",
    "                        relationship: type(r)\n",
    "                    }) as connections\n",
    "                \"\"\",\n",
    "                entity=entity\n",
    "                )\n",
    "\n",
    "                connections = connections_result.single()[\"connections\"]\n",
    "\n",
    "                # Create metadata dictionary\n",
    "                metadata = {}\n",
    "                if data.get(\"metadata\") and isinstance(data[\"metadata\"], dict):\n",
    "                    metadata.update(data[\"metadata\"])\n",
    "\n",
    "                metadata.update({\n",
    "                    \"source\": data.get(\"source\"),\n",
    "                    \"entity\": entity,\n",
    "                    \"graph_connections\": [\n",
    "                        f\"{conn['entity']} ({conn['relationship']})\"\n",
    "                        for conn in connections\n",
    "                        if conn.get('entity')\n",
    "                    ]\n",
    "                })\n",
    "\n",
    "                # Create NodeWithScore\n",
    "                node = TextNode(\n",
    "                    text=data.get(\"text\", \"\"),\n",
    "                    metadata=metadata,\n",
    "                    id_=f\"graph_entity_{entity}\"\n",
    "                )\n",
    "                nodes_with_scores.append(NodeWithScore(node=node, score=score))\n",
    "\n",
    "            return nodes_with_scores\n",
    "    finally:\n",
    "        driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Searching for entities...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.AggregationSkippedNull} {category: UNRECOGNIZED} {title: The query contains an aggregation function that skips null values.} {description: null value eliminated in set function.} {position: None} for query: \"\\n                MATCH (start:Entity)\\n                WHERE start.name IN $entities\\n                \\n                OPTIONAL MATCH (start)-[r]-(connected:Entity)\\n                WHERE type(r) <> 'CONTAINS' AND type(r) <> 'MENTIONED_IN'\\n                \\n                WITH start.name as entity,\\n                     count(DISTINCT connected) as conn_count\\n                WITH collect({entity: entity, count: conn_count}) as results,\\n                     max(conn_count) as max_count\\n                WHERE max_count > 0\\n                \\n                UNWIND results as result\\n                RETURN \\n                    result.entity as entity,\\n                    toFloat(result.count) / toFloat(max_count) * $max_score as score\\n                ORDER BY score DESC\\n                LIMIT $k\\n            \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Found entities: ['calcium', 'free_calcium_detection', 'high_levels_can_cause_calcium_and_other_elements_to_precipitate_out', 'Calcium_atoms', 'magnesium_atoms', '7_milliequivalents_of_calcium', 'cations_like_calcium_magnesium_and_potassium', 'calcium_to_magnesium_ratio', 'ideal_calcium_to_magnesium_ratio', 'magnesium_uptake', 'soil_deficiency_in_calcium', 'lack_of_calcium', 'magnesium', 'magnesium_deficiency', 'calcium_deficiencies_in_tissues', 'calcium_nutrients', '1.0_mEq_of_calcium', '1.0_mEq_of_magnesium', 'approximately_68_percent_calcium', 'calcium_carbonate_equivalents or milliequivalents or bicarbonates', 'calcium_in_plant', 'calcium_absorption', 'calcium_channels', 'calcium_movement_into_cell', 'calcium_transport_energy', 'calcium_transport_inside_root_cells', 'calcium_movement_within_xylem', 'calcium_mobility_within_plant', 'calcium_transported_to_new_leaves_and_shoots', 'calcium_transported_to_shoots', 'calcium_transported_to_developing_fruits', 'calcium_and_organic_fertilizer', 'calcium_plant_nutrition', 'calcium_deficiency_under_severe_cases', 'sources_of_calcium', 'calcium_carbonate', 'calcium_carbonate_concentrations', 'calcium_nitrate_or_calcium_chloride', 'calcium_uptake', 'calcium_deficiency', 'calcium_fertility_management', 'calcium_concentrations_supplied_through_irrigation_water', 'calcium_deficiency_diagnosis', 'insufficient_calcium_during_vegetative_stage', 'adequate_calcium_levels_during_flowering', 'sufficient_calcium_levels', 'focusing_on_calcium_uptake_during_vegetative_stage', 'continuous_calcium_supply', 'calcium_management', 'tremendous_amount_of_calcium', 'enormous_calcium_requirement', 'calcium_transport', 'alkaline_calcium_amendments_like_wollastonite_and_oyster_shell', 'MAGNESIUM', 'Magnesium', 'Calcium', 'Calcium_bicarbonate', 'calcium_levels', 'magnesium_levels', 'calcium_in_plant_cells', 'calcium_in_soil', 'Magnesium_plants', 'magnesium_ion', 'Magnesium_deficiency', 'Gross_magnesium_deficiency', 'Magnesium_deficiency_diagnosis', 'Magnesium_saturation', 'about_19%_potassium_12%_magnesium_23%_sulfur', '18%_potassium_11%_magnesium_22%_sulfur', 'magnesium_in_soil', 'M3_Calcium', 'M3_Magnesium', '79.22 for Calcium', '12.56 for Magnesium']\n",
      "Scored entities: [('calcium', 0.95), ('magnesium', 0.4433333333333333), ('Calcium', 0.31666666666666665), ('Magnesium', 0.31666666666666665), ('magnesium_deficiency', 0.19)]\n",
      "\n",
      "Fetching content for calcium\n",
      "\n",
      "Fetching content for magnesium\n",
      "\n",
      "Fetching content for Calcium\n",
      "\n",
      "Fetching content for Magnesium\n",
      "\n",
      "Fetching content for magnesium_deficiency\n",
      "\n",
      "Total results returned: 5\n",
      "\n",
      "Score: 0.950\n",
      "Entity: calcium\n",
      "Text content:\n",
      "# Knowledge Document: KIS Organics is live with Soil Doctor! March 21, 2024  \n",
      "## Introduction  \n",
      "The speakers in this transcript are Mason, a farmer and consultant, and Bryant, the host. Mason has extensive experience in organic farming and consulting.  \n",
      "This transcript covers a wide range of topics related to organic growing practices, including soil management, nutrient cycling, fertilizers, and sustainable agriculture. The discussion provides valuable insights and practical advice based on the speakers' personal experiences and scientific knowledge.  \n",
      "## Raised Bed Construction  \n",
      "- For safe and affordable raised bed construction, Mason recommends using untreated cedar or redwood lumber. Specifically, he states:  \n",
      "> \"I would get rough cut, two by six cedar. And that's what I would make the beds out of with four by four posts in the corners.\"  \n",
      "- Alternatives like treated lumber, cinder blocks, or plywood are not recommended due to potential contamination or aesthetic concerns.\n",
      "- Bryant is experimenting with charring and oiling inexpensive pine lumber from Home Depot to extend its lifespan.  \n",
      "## Organic Amendments and Fertilizers  \n",
      "### Coffee Grounds\n",
      "- Both speakers are open to using coffee grounds as an organic amendment, as they contain nitrogen and can be a good way to recycle waste.\n",
      "- Moderation is advised, as excessive quantities may lead to nitrogen imbalances.\n",
      "- Bryant notes: \"I think they're great. I mean, I've always applied them just to my compost pile or my worm bin.\"  \n",
      "### Hydrofiber\n",
      "- Hydrofiber is discussed as a potential replacement for perlite or peat moss, but neither speaker has extensive experience with it.\n",
      "- It may have different properties than peat moss and require adjustment in fertilizer application rates.  \n",
      "### Oyster Shell Flour\n",
      "- Oyster shell flour is a mined product that can provide calcium to the soil.\n",
      "- Its availability to plants depends on factors like soil pH, microbial activity, temperature, and moisture.\n",
      "- Typically, it takes around 7-14 days for plants to show a response when conditions are favorable for microbial activity.\n",
      "- Discussing oyster shell flour availability, Mason mentions: \"I want to guess like a 342 range. It was kind of a pretty balanced one from what I remember.\"  \n",
      "### Humic Acids\n",
      "- Humic acids are used as a soluble carbon input and to help chelate micronutrients.\n",
      "- Long-term effects of high humic acid use in living soil are not well understood by the speakers.  \n",
      "### Pit Moss\n",
      "- Pit Moss is a cardboard byproduct being explored as a potential peat moss replacement.\n",
      "- It has different properties than peat moss, with a higher pH and water-holding capacity.\n",
      "- Bryant has not yet cracked the code for using it as a full peat moss replacement in his growing system.  \n",
      "## Nutrient Cycling and Microbial Activity  \n",
      "- Temperature, moisture, and oxygen levels are the primary drivers of nutrient cycling in the soil.\n",
      "- Fungal-to-bacterial biomass ratios can fluctuate based on environmental conditions and may not be the best indicator of soil health.\n",
      "- Microbial diversity and abundance are supported by continually introducing carbon sources through organic amendments and cover crops.\n",
      "- Excessive drying can reduce microbial activity, but microbes can persist in microfilms of water and quickly rebound when moisture is reintroduced.\n",
      "- The impact of conventional fertilizers on microbial populations is debated, with potential effects dependent on factors like salt index, application rates, and long-term carbon inputs.  \n",
      "## Tissue vs. Sap Testing  \n",
      "- Mason recommends starting with tissue testing for nutrient management, as it provides a higher return on investment and is easier to interpret than sap testing.\n",
      "- Sap testing can be valuable for large commercial growers aiming to optimize nitrogen management but requires frequent testing and a deeper commitment.\n",
      "- In Mason's experience, sap testing did not provide additional benefits over tissue testing despite the higher cost. He states:  \n",
      "> \"I've gotten nothing additional from the probably $1,000 I've spent sap testing. Then I've gotten from tissue testing. Nothing. And I've spent $200 tissue testing. And I've gotten no conclusions that have been better than my tissue results.\"  \n",
      "## Best Carbon Sources for Small Growers  \n",
      "- Organic growers are already introducing significant carbon through amendments like alfalfa meal, bone meal, kelp meal, and compost.\n",
      "- Additional carbon can come from slow-release sources like mulch, wood chips (with caution), or fast-release sources like liquid fish, amino acids, teas, and ferments.\n",
      "- Plants themselves contribute a substantial amount of carbon to the soil through root exudates.\n",
      "Graph Connections:\n",
      "2_cups/yard_of_bone_meal (REQUIRES)\n",
      "Oyster_shell_flour (PROVIDES)\n",
      "soil_structure_through_flocculation (IMPACTS)\n",
      "plants (FACILITATES_NUTRIENT_ENTRY_AND_EXIT)\n",
      "TRUE (XYLEM_MOBILE_IS)\n",
      "nutrient_poor_crops (LOW_LEVELS_LEAD_TO)\n",
      "fertilizer (SOURCE_OF)\n",
      "cannabis_plants (GROWS_THROUGHOUT_LIFECYCLE)\n",
      "vegetative_stage (EMPHASIZED_FOR)\n",
      "water (CARRIES)\n",
      "60-80% (TARGET)\n",
      "trace_element_deficiencies (PARTICULARLY_IN)\n",
      "81.28 (PERCENTAGE)\n",
      "mehlic-3 (MEASURED_ON)\n",
      "ideal_amount (OF)\n",
      "\n",
      "Score: 0.443\n",
      "Entity: magnesium\n",
      "Text content:\n",
      "# Magnesium\n",
      "(Bill McKibbens - The Art of Balancing Soil Nutrients)\n",
      "Magnesium is most often associated with chlorophyll formation in plants. Without magnesium there would be no chlorophyll or green plants—the basis of life on earth. Based on this aspect alone, magnesium is a powerful nutrient, but it is also very important for phosphorus uptake in the plant. Magnesium deficiency looks a lot like manganese deficiency with its interveinal chlorosis (dark green veins and light green between veins). Since magnesium is also involved in phosphorus uptake, some plants may take on a reddish color like that shown by phosphorus deficiency. Magnesium deficiencies are more prevalent in sandy soils but can be induced in heavier soils due to high potassium, ammonium or calcium applications.\n",
      "Graph Connections:\n",
      "phosphorus_uptake (IMPORTANT_FOR)\n",
      "chlorophyll_formation (ASSOCIATED_WITH)\n",
      "Dolomite_lime (IS_A_SOURCE_OF)\n",
      "9.48 (PERCENTAGE)\n",
      "Yes (IGNORE_ADDED_EPSOM_SALT)\n",
      "mehlic-3 (MEASURED_ON)\n",
      "ideal_amount (OF)\n",
      "\n",
      "Score: 0.317\n",
      "Entity: Calcium\n",
      "Text content:\n",
      "#Calcium_additive #raise_ph #Wollastonite #Silicon_additive #buffer_pH #Calcium\n",
      "Growers  turn to Wollastonite for:\n",
      "- Its **liming** capability.  Wollastonite's dissolution rate is slower than agricultural lime, offering a buffering effect against rapid pH changes. This makes Wollastonite beneficial in areas with fluctuating acidity levels.\n",
      "- Adding **Silicon**.\n",
      "- Adding **Calcium**.\n",
      "Wollastonite's pH buffering effect and Silicon content contribute to pest control and powdery mildew suppression, although the exact mechanisms are not fully understood.\n",
      "Graph Connections:\n",
      "Wollastonite (PROVIDES)\n",
      "Dolomite_lime (TAKES_LONGER_TO_BREAK_DOWN_THAN)\n",
      "10278 lbs/acre (MEASURED_IN_M3)\n",
      "4000 lbs/acre (SETS_TARGET_IN_M3)\n",
      "78 (PERCENT_IN_SATURATED_PASTE_IS)\n",
      "\n",
      "Score: 0.317\n",
      "Entity: Magnesium\n",
      "Text content:\n",
      "#magnesium #deficiency #mg_deficiency  \n",
      "# Magnesium (Mg) - mobile  \n",
      "![[Pasted image 20240604134648.png]]  \n",
      "## Deficiency: Common indoors.\n",
      "Lower and later middle leaves develop yellow patches between darker green veins and rusty brown spots on leaf margins, tips and between veins. Leaf tips usually curl upward before dying. The entire plant could discolor in a few weeks and if severe turn a yellow/whitish tinge before browning and dying. Minor deficiencies can escalate and cause a diminished harvest.  \n",
      "It is often in soil but unavailable because soil is too wet/cold or acidic/cold. An excess of K, ammonia (nitrogen) and calcium (carbonate) bind Mg in soil. Small root systems are unable to take in enough Mg to supply heavy demand. A high EC slows water evaporation and diminishes Mg availability.  \n",
      "- Interveinal yellowing, irregular rust-brown spots on older leaves\n",
      "- Leaf tips turn brown and curl upwards\n",
      "- Rust-brown spots multiply and interveinal yellowing increases\n",
      "- Spots and yellowing envelop entire plant\n",
      "- Leaves dry and die in extreme cases  \n",
      "## Treat Deficiency  \n",
      "Water with two teaspoons of Epsom salts (magnesium sulfate) per gallon of water. For fast results, spray foliage with a 2 percent solution of Epsom salts. Greening starts at top of plant and moves downward. Add same dose until symptoms disappear. Or apply magnesium sulfate monohydrate. Add fine dolomite lime when planting to ensure a supply of calcium and Mg.  \n",
      "Keep root zone and nutrient solution 70 - 75 degrees F. Keep ambient air temperature at 75 degrees day and 65 degrees night. Use a complete fertilizer with Mg. Keep soil pH above 6.5, keep hydroponic pH above 5.5, and lower high EC for a week.\n",
      "## Toxicity\n",
      "Toxicity is rare and difficult to discern with the naked eye. If extremely toxic, Mg conflicts most often with calcium, especially in hydroponics. Toxic buildup in soils is uncommon.\n",
      "Graph Connections:\n",
      "True (IS_MOBILE)\n",
      "507 lbs/acre (MEASURED_IN_M3)\n",
      "350 lbs/acre (SETS_TARGET_IN_M3)\n",
      "9.83 (PERCENT_IN_SATURATED_PASTE_IS)\n",
      "26.99 (PPM_IN_SATURATED_PASTE_IS)\n",
      "\n",
      "Score: 0.190\n",
      "Entity: magnesium_deficiency\n",
      "Text content:\n",
      "# Magnesium\n",
      "(Bill McKibbens - The Art of Balancing Soil Nutrients)\n",
      "Magnesium is most often associated with chlorophyll formation in plants. Without magnesium there would be no chlorophyll or green plants—the basis of life on earth. Based on this aspect alone, magnesium is a powerful nutrient, but it is also very important for phosphorus uptake in the plant. Magnesium deficiency looks a lot like manganese deficiency with its interveinal chlorosis (dark green veins and light green between veins). Since magnesium is also involved in phosphorus uptake, some plants may take on a reddish color like that shown by phosphorus deficiency. Magnesium deficiencies are more prevalent in sandy soils but can be induced in heavier soils due to high potassium, ammonium or calcium applications.\n",
      "Graph Connections:\n",
      "manganese_deficiency (LOOKS_LIKE)\n",
      "interveinal_chlorosis (SHOWS)\n",
      "heavier_soils (CAN_BE_INDUCED_IN)\n"
     ]
    }
   ],
   "source": [
    "# Test the function\n",
    "results = retrieve_from_knowledge_graph([\"calcium\", \"magnesium\"], k=5)\n",
    "print(f\"\\nTotal results returned: {len(results)}\")\n",
    "for node_with_score in results:\n",
    "    print(f\"\\nScore: {node_with_score.score:.3f}\")\n",
    "    print(f\"Entity: {node_with_score.node.metadata['entity']}\")\n",
    "    print(\"Text content:\")\n",
    "    print(node_with_score.node.get_content(metadata_mode=MetadataMode.NONE))\n",
    "    print(\"Graph Connections:\")\n",
    "    print(\"\\n\".join(node_with_score.node.metadata[\"graph_connections\"]))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Our graph has two main types of nodes:\n",
    "\n",
    "- Entity nodes: Represent concepts with name properties\n",
    "- TextNode nodes: Represent content chunks with text properties\n",
    "\n",
    "And two main types of relationships:\n",
    "\n",
    "- MENTIONED_IN: Links Entities to the TextNodes where they appear\n",
    "- Semantic relationships (like IMPACTS, CRITICAL_FOR, etc.): Link Entities to other Entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "ename": "ServiceUnavailable",
     "evalue": "Couldn't connect to localhost:7687 (resolved to ()):\nFailed to establish connection to ResolvedIPv6Address(('::1', 7687, 0, 0)) (reason [WinError 10061] No connection could be made because the target machine actively refused it)\nFailed to establish connection to ResolvedIPv4Address(('127.0.0.1', 7687)) (reason [WinError 10061] No connection could be made because the target machine actively refused it)",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mConnectionRefusedError\u001b[0m                    Traceback (most recent call last)",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_async_compat\\network\\_bolt_socket.py:555\u001b[0m, in \u001b[0;36mBoltSocket._connect\u001b[1;34m(cls, resolved_address, timeout, keep_alive)\u001b[0m\n\u001b[0;32m    554\u001b[0m log\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m[#0000]  C: <OPEN> \u001b[39m\u001b[38;5;132;01m%s\u001b[39;00m\u001b[38;5;124m\"\u001b[39m, resolved_address)\n\u001b[1;32m--> 555\u001b[0m \u001b[43ms\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconnect\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresolved_address\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    556\u001b[0m s\u001b[38;5;241m.\u001b[39msettimeout(t)\n",
      "\u001b[1;31mConnectionRefusedError\u001b[0m: [WinError 10061] No connection could be made because the target machine actively refused it",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m                        Traceback (most recent call last)",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_async_compat\\network\\_bolt_socket.py:741\u001b[0m, in \u001b[0;36mBoltSocket.connect\u001b[1;34m(cls, address, tcp_timeout, deadline, custom_resolver, ssl_context, keep_alive)\u001b[0m\n\u001b[0;32m    740\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 741\u001b[0m     s \u001b[38;5;241m=\u001b[39m \u001b[43mBoltSocket\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connect\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    742\u001b[0m \u001b[43m        \u001b[49m\u001b[43mresolved_address\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtcp_timeout\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mkeep_alive\u001b[49m\n\u001b[0;32m    743\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    744\u001b[0m     s \u001b[38;5;241m=\u001b[39m BoltSocket\u001b[38;5;241m.\u001b[39m_secure(\n\u001b[0;32m    745\u001b[0m         s, resolved_address\u001b[38;5;241m.\u001b[39m_host_name, ssl_context\n\u001b[0;32m    746\u001b[0m     )\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_async_compat\\network\\_bolt_socket.py:577\u001b[0m, in \u001b[0;36mBoltSocket._connect\u001b[1;34m(cls, resolved_address, timeout, keep_alive)\u001b[0m\n\u001b[0;32m    576\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(error, \u001b[38;5;167;01mOSError\u001b[39;00m):\n\u001b[1;32m--> 577\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m ServiceUnavailable(\n\u001b[0;32m    578\u001b[0m         \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mFailed to establish connection to \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mresolved_address\u001b[38;5;132;01m!r}\u001b[39;00m\u001b[38;5;124m \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    579\u001b[0m         \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m(reason \u001b[39m\u001b[38;5;132;01m{\u001b[39;00merror\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m)\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    580\u001b[0m     ) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01merror\u001b[39;00m\n\u001b[0;32m    581\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m: Failed to establish connection to ResolvedIPv6Address(('::1', 7687, 0, 0)) (reason [WinError 10061] No connection could be made because the target machine actively refused it)",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m                        Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[52], line 31\u001b[0m\n\u001b[0;32m     28\u001b[0m     \u001b[38;5;28;01mfinally\u001b[39;00m:\n\u001b[0;32m     29\u001b[0m         driver\u001b[38;5;241m.\u001b[39mclose()\n\u001b[1;32m---> 31\u001b[0m \u001b[43minspect_problematic_nodes\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[1;32mIn[52], line 6\u001b[0m, in \u001b[0;36minspect_problematic_nodes\u001b[1;34m()\u001b[0m\n\u001b[0;32m      3\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m      4\u001b[0m     \u001b[38;5;28;01mwith\u001b[39;00m driver\u001b[38;5;241m.\u001b[39msession(database\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtest\u001b[39m\u001b[38;5;124m\"\u001b[39m) \u001b[38;5;28;01mas\u001b[39;00m session:\n\u001b[0;32m      5\u001b[0m         \u001b[38;5;66;03m# Only look for Entity nodes with missing names\u001b[39;00m\n\u001b[1;32m----> 6\u001b[0m         result \u001b[38;5;241m=\u001b[39m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\n\u001b[0;32m      7\u001b[0m \u001b[38;5;124;43m            MATCH (n:Entity)\u001b[39;49m\n\u001b[0;32m      8\u001b[0m \u001b[38;5;124;43m            WHERE n.name IS NULL OR n.name = \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\n\u001b[0;32m      9\u001b[0m \u001b[38;5;124;43m            WITH n, labels(n) as node_labels\u001b[39;49m\n\u001b[0;32m     10\u001b[0m \u001b[38;5;124;43m            OPTIONAL MATCH (n)-[r]-()\u001b[39;49m\n\u001b[0;32m     11\u001b[0m \u001b[38;5;124;43m            RETURN \u001b[39;49m\n\u001b[0;32m     12\u001b[0m \u001b[38;5;124;43m                node_labels,\u001b[39;49m\n\u001b[0;32m     13\u001b[0m \u001b[38;5;124;43m                n,\u001b[39;49m\n\u001b[0;32m     14\u001b[0m \u001b[38;5;124;43m                count(r) as relationship_count,\u001b[39;49m\n\u001b[0;32m     15\u001b[0m \u001b[38;5;124;43m                collect(DISTINCT type(r)) as relationship_types\u001b[39;49m\n\u001b[0;32m     16\u001b[0m \u001b[38;5;124;43m            LIMIT 10\u001b[39;49m\n\u001b[0;32m     17\u001b[0m \u001b[38;5;124;43m        \u001b[39;49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[0;32m     19\u001b[0m         \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mEntity nodes with missing/null names:\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m     20\u001b[0m         \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m-\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;241m*\u001b[39m \u001b[38;5;241m50\u001b[39m)\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:306\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    303\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\u001b[38;5;241m.\u001b[39m_buffer_all()\n\u001b[0;32m    305\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection:\n\u001b[1;32m--> 306\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connect\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    307\u001b[0m     \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[0;32m    308\u001b[0m cx \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:130\u001b[0m, in \u001b[0;36mSession._connect\u001b[1;34m(self, access_mode, **acquire_kwargs)\u001b[0m\n\u001b[0;32m    128\u001b[0m     access_mode \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mdefault_access_mode\n\u001b[0;32m    129\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 130\u001b[0m     \u001b[38;5;28;43msuper\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connect\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    131\u001b[0m \u001b[43m        \u001b[49m\u001b[43maccess_mode\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mauth\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mauth\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43macquire_kwargs\u001b[49m\n\u001b[0;32m    132\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    133\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39mCancelledError:\n\u001b[0;32m    134\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_handle_cancellation(message\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m_connect\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\work\\workspace.py:184\u001b[0m, in \u001b[0;36mWorkspace._connect\u001b[1;34m(self, access_mode, auth, **acquire_kwargs)\u001b[0m\n\u001b[0;32m    175\u001b[0m acquire_kwargs_ \u001b[38;5;241m=\u001b[39m {\n\u001b[0;32m    176\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124maccess_mode\u001b[39m\u001b[38;5;124m\"\u001b[39m: access_mode,\n\u001b[0;32m    177\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtimeout\u001b[39m\u001b[38;5;124m\"\u001b[39m: acquisition_timeout,\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    181\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mliveness_check_timeout\u001b[39m\u001b[38;5;124m\"\u001b[39m: \u001b[38;5;28;01mNone\u001b[39;00m,\n\u001b[0;32m    182\u001b[0m }\n\u001b[0;32m    183\u001b[0m acquire_kwargs_\u001b[38;5;241m.\u001b[39mupdate(acquire_kwargs)\n\u001b[1;32m--> 184\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_pool\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43macquire\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43macquire_kwargs_\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    185\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection_access_mode \u001b[38;5;241m=\u001b[39m access_mode\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_pool.py:596\u001b[0m, in \u001b[0;36mBoltPool.acquire\u001b[1;34m(self, access_mode, timeout, database, bookmarks, auth, liveness_check_timeout)\u001b[0m\n\u001b[0;32m    589\u001b[0m log\u001b[38;5;241m.\u001b[39mdebug(\n\u001b[0;32m    590\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m[#0000]  _: <POOL> acquire direct connection, \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    591\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124maccess_mode=\u001b[39m\u001b[38;5;132;01m%r\u001b[39;00m\u001b[38;5;124m, database=\u001b[39m\u001b[38;5;132;01m%r\u001b[39;00m\u001b[38;5;124m\"\u001b[39m,\n\u001b[0;32m    592\u001b[0m     access_mode,\n\u001b[0;32m    593\u001b[0m     database,\n\u001b[0;32m    594\u001b[0m )\n\u001b[0;32m    595\u001b[0m deadline \u001b[38;5;241m=\u001b[39m Deadline\u001b[38;5;241m.\u001b[39mfrom_timeout_or_deadline(timeout)\n\u001b[1;32m--> 596\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_acquire\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    597\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maddress\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mauth\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdeadline\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mliveness_check_timeout\u001b[49m\n\u001b[0;32m    598\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_pool.py:346\u001b[0m, in \u001b[0;36mIOPool._acquire\u001b[1;34m(self, address, auth, deadline, liveness_check_timeout)\u001b[0m\n\u001b[0;32m    341\u001b[0m             \u001b[38;5;28;01mraise\u001b[39;00m ClientError(\n\u001b[0;32m    342\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mfailed to obtain a connection from the pool within \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    343\u001b[0m                 \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mdeadline\u001b[38;5;241m.\u001b[39moriginal_timeout\u001b[38;5;132;01m!r}\u001b[39;00m\u001b[38;5;124ms (timeout)\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    344\u001b[0m             )\n\u001b[0;32m    345\u001b[0m log\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m[#0000]  _: <POOL> trying to hand out new connection\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m--> 346\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mconnection_creator\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_pool.py:169\u001b[0m, in \u001b[0;36mIOPool._acquire_new_later.<locals>.connection_creator\u001b[1;34m()\u001b[0m\n\u001b[0;32m    167\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m    168\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 169\u001b[0m         connection \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mopener\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    170\u001b[0m \u001b[43m            \u001b[49m\u001b[43maddress\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mauth\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpool_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mauth\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdeadline\u001b[49m\n\u001b[0;32m    171\u001b[0m \u001b[43m        \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    172\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m ServiceUnavailable:\n\u001b[0;32m    173\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mdeactivate(address)\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_pool.py:559\u001b[0m, in \u001b[0;36mBoltPool.open.<locals>.opener\u001b[1;34m(addr, auth_manager, deadline)\u001b[0m\n\u001b[0;32m    558\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mopener\u001b[39m(addr, auth_manager, deadline):\n\u001b[1;32m--> 559\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mBolt\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mopen\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    560\u001b[0m \u001b[43m        \u001b[49m\u001b[43maddr\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    561\u001b[0m \u001b[43m        \u001b[49m\u001b[43mauth_manager\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mauth_manager\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    562\u001b[0m \u001b[43m        \u001b[49m\u001b[43mdeadline\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mdeadline\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    563\u001b[0m \u001b[43m        \u001b[49m\u001b[43mrouting_context\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\n\u001b[0;32m    564\u001b[0m \u001b[43m        \u001b[49m\u001b[43mpool_config\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mpool_config\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    565\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:445\u001b[0m, in \u001b[0;36mBolt.open\u001b[1;34m(cls, address, auth_manager, deadline, routing_context, pool_config)\u001b[0m\n\u001b[0;32m    442\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m deadline \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[0;32m    443\u001b[0m     deadline \u001b[38;5;241m=\u001b[39m Deadline(\u001b[38;5;28;01mNone\u001b[39;00m)\n\u001b[1;32m--> 445\u001b[0m s, protocol_version, handshake, data \u001b[38;5;241m=\u001b[39m \u001b[43mBoltSocket\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconnect\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    446\u001b[0m \u001b[43m    \u001b[49m\u001b[43maddress\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    447\u001b[0m \u001b[43m    \u001b[49m\u001b[43mtcp_timeout\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mpool_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconnection_timeout\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    448\u001b[0m \u001b[43m    \u001b[49m\u001b[43mdeadline\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mdeadline\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    449\u001b[0m \u001b[43m    \u001b[49m\u001b[43mcustom_resolver\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mpool_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresolver\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    450\u001b[0m \u001b[43m    \u001b[49m\u001b[43mssl_context\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mpool_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget_ssl_context\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    451\u001b[0m \u001b[43m    \u001b[49m\u001b[43mkeep_alive\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mpool_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mkeep_alive\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    452\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    454\u001b[0m pool_config\u001b[38;5;241m.\u001b[39mprotocol_version \u001b[38;5;241m=\u001b[39m protocol_version\n\u001b[0;32m    456\u001b[0m \u001b[38;5;66;03m# Carry out Bolt subclass imports locally to avoid circular dependency\u001b[39;00m\n\u001b[0;32m    457\u001b[0m \u001b[38;5;66;03m# issues.\u001b[39;00m\n\u001b[0;32m    458\u001b[0m \n\u001b[0;32m    459\u001b[0m \u001b[38;5;66;03m# avoid new lines after imports for better readability and conciseness\u001b[39;00m\n\u001b[0;32m    460\u001b[0m \u001b[38;5;66;03m# fmt: off\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\happy\\Documents\\Projects\\askgrowbuddy\\.venv\\Lib\\site-packages\\neo4j\\_async_compat\\network\\_bolt_socket.py:775\u001b[0m, in \u001b[0;36mBoltSocket.connect\u001b[1;34m(cls, address, tcp_timeout, deadline, custom_resolver, ssl_context, keep_alive)\u001b[0m\n\u001b[0;32m    773\u001b[0m resolved_address_strs \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mtuple\u001b[39m(\u001b[38;5;28mmap\u001b[39m(\u001b[38;5;28mstr\u001b[39m, resolved_addresses))\n\u001b[0;32m    774\u001b[0m error_strs \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;241m.\u001b[39mjoin(\u001b[38;5;28mmap\u001b[39m(\u001b[38;5;28mstr\u001b[39m, errors))\n\u001b[1;32m--> 775\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m ServiceUnavailable(\n\u001b[0;32m    776\u001b[0m     \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCouldn\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mt connect to \u001b[39m\u001b[38;5;132;01m{\u001b[39;00maddress\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    777\u001b[0m     \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m(resolved to \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mresolved_address_strs\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m):\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    778\u001b[0m     \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;132;01m{\u001b[39;00merror_strs\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    779\u001b[0m ) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01merrors\u001b[39;00m[\u001b[38;5;241m0\u001b[39m]\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m: Couldn't connect to localhost:7687 (resolved to ()):\nFailed to establish connection to ResolvedIPv6Address(('::1', 7687, 0, 0)) (reason [WinError 10061] No connection could be made because the target machine actively refused it)\nFailed to establish connection to ResolvedIPv4Address(('127.0.0.1', 7687)) (reason [WinError 10061] No connection could be made because the target machine actively refused it)"
     ]
    }
   ],
   "source": [
    "def inspect_problematic_nodes():\n",
    "    driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"asd@123qwe\"))\n",
    "    try:\n",
    "        with driver.session(database=\"test\") as session:\n",
    "            # Only look for Entity nodes with missing names\n",
    "            result = session.run(\"\"\"\n",
    "                MATCH (n:Entity)\n",
    "                WHERE n.name IS NULL OR n.name = ''\n",
    "                WITH n, labels(n) as node_labels\n",
    "                OPTIONAL MATCH (n)-[r]-()\n",
    "                RETURN\n",
    "                    node_labels,\n",
    "                    n,\n",
    "                    count(r) as relationship_count,\n",
    "                    collect(DISTINCT type(r)) as relationship_types\n",
    "                LIMIT 10\n",
    "            \"\"\")\n",
    "\n",
    "            print(\"Entity nodes with missing/null names:\")\n",
    "            print(\"-\" * 50)\n",
    "            for record in result:\n",
    "                print(f\"Labels: {record['node_labels']}\")\n",
    "                print(f\"Properties: {dict(record['n'])}\")\n",
    "                print(f\"Relationship count: {record['relationship_count']}\")\n",
    "                print(f\"Relationship types: {record['relationship_types']}\")\n",
    "                print(\"-\" * 30)\n",
    "\n",
    "    finally:\n",
    "        driver.close()\n",
    "\n",
    "inspect_problematic_nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Source files in knowledge graph:\n",
      "--------------------------------------------------\n",
      "soil science notes.md: 33 nodes\n",
      "ph.md: 1 nodes\n",
      "Focusing on Calcium Nutrition.md: 1 nodes\n",
      "--------------------------------------------------\n",
      "Total TextNodes: 35\n"
     ]
    }
   ],
   "source": [
    "# Query Neo4j for all unique source files\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"asd@123qwe\"))\n",
    "database = \"test\"\n",
    "try:\n",
    "    with driver.session(database=database) as session:\n",
    "        # Query for distinct source files from TextNode nodes\n",
    "        result = session.run(\"\"\"\n",
    "            MATCH (n:TextNode)\n",
    "            WHERE n.source IS NOT NULL\n",
    "            RETURN DISTINCT n.source as source, count(*) as count\n",
    "            ORDER BY count DESC\n",
    "        \"\"\")\n",
    "\n",
    "        print(\"Source files in knowledge graph:\")\n",
    "        print(\"-\" * 50)\n",
    "        total_nodes = 0\n",
    "        for record in result:\n",
    "            source = record[\"source\"]\n",
    "            count = record[\"count\"]\n",
    "            total_nodes += count\n",
    "            print(f\"{source}: {count} nodes\")\n",
    "        print(\"-\" * 50)\n",
    "        print(f\"Total TextNodes: {total_nodes}\")\n",
    "\n",
    "finally:\n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Knowledge Graph Source Statistics\n",
      "==================================================\n",
      "\n",
      "File Size Distribution:\n",
      "\n",
      "Large files (>10 nodes):\n",
      "------------------------------\n",
      "soil science notes.md                               33 nodes\n",
      "\n",
      "Medium files (5-10 nodes):\n",
      "------------------------------\n",
      "\n",
      "Small files (2-4 nodes):\n",
      "------------------------------\n",
      "\n",
      "Tiny files (1 node):\n",
      "------------------------------\n",
      "ph.md                                                1 nodes\n",
      "Focusing on Calcium Nutrition.md                     1 nodes\n",
      "\n",
      "Overall Statistics:\n",
      "------------------------------\n",
      "Total files:          3\n",
      "Total nodes:          35\n",
      "Average nodes/file:   11.7\n",
      "Median nodes/file:    1\n"
     ]
    }
   ],
   "source": [
    "# Query Neo4j for source statistics with detailed file listings\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"asd@123qwe\"))\n",
    "database = \"test\"\n",
    "try:\n",
    "    with driver.session(database=database) as session:\n",
    "        result = session.run(\"\"\"\n",
    "            MATCH (n:TextNode)\n",
    "            WHERE n.source IS NOT NULL\n",
    "            RETURN DISTINCT n.source as source, count(*) as count\n",
    "            ORDER BY count DESC\n",
    "        \"\"\")\n",
    "\n",
    "        # Collect results\n",
    "        sources = [(record[\"source\"], record[\"count\"]) for record in result]\n",
    "        total_nodes = sum(count for _, count in sources)\n",
    "\n",
    "        print(\"Knowledge Graph Source Statistics\")\n",
    "        print(\"=\" * 50)\n",
    "\n",
    "        # Distribution by size with file listings\n",
    "        print(\"\\nFile Size Distribution:\")\n",
    "        print(\"\\nLarge files (>10 nodes):\")\n",
    "        print(\"-\" * 30)\n",
    "        for source, count in sources:\n",
    "            if count > 10:\n",
    "                print(f\"{source:<50} {count:>3} nodes\")\n",
    "\n",
    "        print(\"\\nMedium files (5-10 nodes):\")\n",
    "        print(\"-\" * 30)\n",
    "        for source, count in sources:\n",
    "            if 5 <= count <= 10:\n",
    "                print(f\"{source:<50} {count:>3} nodes\")\n",
    "\n",
    "        print(\"\\nSmall files (2-4 nodes):\")\n",
    "        print(\"-\" * 30)\n",
    "        for source, count in sources:\n",
    "            if 2 <= count <= 4:\n",
    "                print(f\"{source:<50} {count:>3} nodes\")\n",
    "\n",
    "        print(\"\\nTiny files (1 node):\")\n",
    "        print(\"-\" * 30)\n",
    "        for source, count in sources:\n",
    "            if count == 1:\n",
    "                print(f\"{source:<50} {count:>3} nodes\")\n",
    "\n",
    "        # Overall stats\n",
    "        print(\"\\nOverall Statistics:\")\n",
    "        print(\"-\" * 30)\n",
    "        print(f\"Total files:          {len(sources)}\")\n",
    "        print(f\"Total nodes:          {total_nodes}\")\n",
    "        print(f\"Average nodes/file:   {total_nodes/len(sources):.1f}\")\n",
    "        print(f\"Median nodes/file:    {sorted([c for _, c in sources])[len(sources)//2]}\")\n",
    "\n",
    "finally:\n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Knowledge Relationships\n",
      "==================================================\n",
      "Relationship Type                   Count\n",
      "--------------------------------------------------\n",
      "MENTIONED_IN                          462 ( 63.4%)\n",
      "CAUSES                                 13 (  1.8%)\n",
      "EQUIVALENT_TO                           8 (  1.1%)\n",
      "AFFECTS                                 7 (  1.0%)\n",
      "IS                                      6 (  0.8%)\n",
      "MOVES_PREDOMINANTLY_VIA                 4 (  0.5%)\n",
      "REQUIRES                                4 (  0.5%)\n",
      "CRITICAL_FOR                            3 (  0.4%)\n",
      "USES                                    3 (  0.4%)\n",
      "IS_A                                    3 (  0.4%)\n",
      "ASSOCIATED_WITH                         3 (  0.4%)\n",
      "CAN_BE_INDUCED_BY                       3 (  0.4%)\n",
      "IS_INVOLVED_IN                          3 (  0.4%)\n",
      "INVOLVED_IN                             3 (  0.4%)\n",
      "REDUCE                                  3 (  0.4%)\n",
      "PLAYS_MANY_ROLES_IN_PLANTS              2 (  0.3%)\n",
      "COMPRISES_APPROXIMATELY                 2 (  0.3%)\n",
      "APPLIED_IN_EMERGENCY_SITUATIONS          2 (  0.3%)\n",
      "FACILITATES                             2 (  0.3%)\n",
      "PREVENTS                                2 (  0.3%)\n",
      "INDICATES                               2 (  0.3%)\n",
      "LEADS_TO                                2 (  0.3%)\n",
      "INFLUENCES                              2 (  0.3%)\n",
      "CAN_CAUSE                               2 (  0.3%)\n",
      "IMPORTANT_FOR                           2 (  0.3%)\n",
      "MOVES                                   2 (  0.3%)\n",
      "OPTIMAL_PH_IS                           1 (  0.1%)\n",
      "IS_CRITICAL_FOR                         1 (  0.1%)\n",
      "PREVALENT_IN                            1 (  0.1%)\n",
      "LIMITED                                 1 (  0.1%)\n",
      "HELPS_UNDERSTAND                        1 (  0.1%)\n",
      "ANOTHER_SOURCE_OF                       1 (  0.1%)\n",
      "IMPACTS                                 1 (  0.1%)\n",
      "TRAVELS_PRIMARILY_IN                    1 (  0.1%)\n",
      "OFTEN_PAIRED_WITH                       1 (  0.1%)\n",
      "LABELED_AS                              1 (  0.1%)\n",
      "COMPUTED                                1 (  0.1%)\n",
      "DOES_THE_SAME_FIDDLE                    1 (  0.1%)\n",
      "DESIGNED_TO_EXTRACT                     1 (  0.1%)\n",
      "LACKS                                   1 (  0.1%)\n",
      "POSSESS                                 1 (  0.1%)\n",
      "DISSOLVES                               1 (  0.1%)\n",
      "CAUSED_BY                               1 (  0.1%)\n",
      "ADVISED_TO_ESTABLISH                    1 (  0.1%)\n",
      "EVALUATES                               1 (  0.1%)\n",
      "MORE_APPROPRIATE                        1 (  0.1%)\n",
      "CRITICAL_TO_MONITOR                     1 (  0.1%)\n",
      "ALIGNS                                  1 (  0.1%)\n",
      "HIGHLIGHTS_THE_IMPORTANCE_OF            1 (  0.1%)\n",
      "ANSWERS_THE_QUESTION_OF                 1 (  0.1%)\n",
      "IS_MIXED_WITH                           1 (  0.1%)\n",
      "SEEPS_OUT_INTO                          1 (  0.1%)\n",
      "TAKES                                   1 (  0.1%)\n",
      "REPRESENTS                              1 (  0.1%)\n",
      "AFFECTS_OUTCOME_OF                      1 (  0.1%)\n",
      "IS_LEFT_TO_SIT_FOR                      1 (  0.1%)\n",
      "IS_VACUUMED_OFF                         1 (  0.1%)\n",
      "UNDERGOES_ANALYSIS                      1 (  0.1%)\n",
      "AIMS_FOR_CONSISTENCY                    1 (  0.1%)\n",
      "INCLUDES                                1 (  0.1%)\n",
      "HAS_THICKNESS                           1 (  0.1%)\n",
      "IS_ASSUMED_TO_WEIGH                     1 (  0.1%)\n",
      "DECOMPOSES_OVER_TIME                    1 (  0.1%)\n",
      "HAS                                     1 (  0.1%)\n",
      "IS_INSTRUMENTAL_IN                      1 (  0.1%)\n",
      "HOLDS_ONTO                              1 (  0.1%)\n",
      "TO_A_LESSER_EXTENT                      1 (  0.1%)\n",
      "SIGNIFICANTLY_ENHANCES                  1 (  0.1%)\n",
      "PLAYS_A_CRITICAL_ROLE_IN                1 (  0.1%)\n",
      "MAKES_AVAILABLE_TO_PLANTS               1 (  0.1%)\n",
      "CONTIBUTES_TO                           1 (  0.1%)\n",
      "CONTRADICTS                             1 (  0.1%)\n",
      "RECOGNIZED_AS                           1 (  0.1%)\n",
      "UNDER_MICROSCOPE_EXAMINATION            1 (  0.1%)\n",
      "ADVANTAGEOUS_FOR                        1 (  0.1%)\n",
      "RELEVANT                                1 (  0.1%)\n",
      "EVOLVES_INTO                            1 (  0.1%)\n",
      "TRANSFORMS_OVER_TIME                    1 (  0.1%)\n",
      "CONSIST_OF                              1 (  0.1%)\n",
      "AFFECTED_BY                             1 (  0.1%)\n",
      "MOISTURE_NEEDED_TO_PREVENT              1 (  0.1%)\n",
      "INACCURATE_DUE_TO                       1 (  0.1%)\n",
      "RAISE_CONCERNS_ABOUT                    1 (  0.1%)\n",
      "HELP_WITH                               1 (  0.1%)\n",
      "COMPOSITION_IMPACTS                     1 (  0.1%)\n",
      "LEAD_TO                                 1 (  0.1%)\n",
      "AFFECT                                  1 (  0.1%)\n",
      "PROBLEMATIC_BECAUSE                     1 (  0.1%)\n",
      "IS_EXPRESSED_AS                         1 (  0.1%)\n",
      "WEIGHS                                  1 (  0.1%)\n",
      "WEIGH_MORE_THAN                         1 (  0.1%)\n",
      "HAS_GREATER_WEIGHT                      1 (  0.1%)\n",
      "CAN_BE_COMPLETELY_SATURATED_BY          1 (  0.1%)\n",
      "HAVE_DIAMETER                           1 (  0.1%)\n",
      "IMPACTED_BY                             1 (  0.1%)\n",
      "ATTRACTED_BY                            1 (  0.1%)\n",
      "PRIMARILY_DUETO                         1 (  0.1%)\n",
      "HELD_IN_SOIL                            1 (  0.1%)\n",
      "ASSIST_IN                               1 (  0.1%)\n",
      "INFLUENCED_BY                           1 (  0.1%)\n",
      "IMPROVED_BY                             1 (  0.1%)\n",
      "ORIGINATES_FROM                         1 (  0.1%)\n",
      "TRANSFORMS_INTO                         1 (  0.1%)\n",
      "DISCUSSED_IN                            1 (  0.1%)\n",
      "INFORMED_BY                             1 (  0.1%)\n",
      "SHOULD_BE_INTRODUCED                    1 (  0.1%)\n",
      "HELPS_AVOID                             1 (  0.1%)\n",
      "RECOMMENDED_RATIO_IS                    1 (  0.1%)\n",
      "IMPORTANT_IN                            1 (  0.1%)\n",
      "IS_ESSENTIAL                            1 (  0.1%)\n",
      "AVOIDS                                  1 (  0.1%)\n",
      "CAN_SIGNIFICANTLY_IMPACT                1 (  0.1%)\n",
      "ALSO_AFFECTS                            1 (  0.1%)\n",
      "IS_NOT_JUST_CRUCIAL                     1 (  0.1%)\n",
      "PLAYS_A_KEY_ROLE                        1 (  0.1%)\n",
      "ARE_MORE_EFFICIENT                      1 (  0.1%)\n",
      "IS_VITAL                                1 (  0.1%)\n",
      "ENHANCES                                1 (  0.1%)\n",
      "IS_KEY                                  1 (  0.1%)\n",
      "STATES                                  1 (  0.1%)\n",
      "ARE                                     1 (  0.1%)\n",
      "DOES_NOT                                1 (  0.1%)\n",
      "LOWERS                                  1 (  0.1%)\n",
      "SUPPLIES                                1 (  0.1%)\n",
      "SCARCE                                  1 (  0.1%)\n",
      "IS_PART_OF                              1 (  0.1%)\n",
      "DETERMINES                              1 (  0.1%)\n",
      "INCLUDED_IN                             1 (  0.1%)\n",
      "SPINS_RAPIDLY_WHEN                      1 (  0.1%)\n",
      "MANIFESTS_NO_OBVIOUS_SYMPTOMS           1 (  0.1%)\n",
      "SAID                                    1 (  0.1%)\n",
      "RECOMMENDED_MINIMUM                     1 (  0.1%)\n",
      "BEST_WAY_TO_ACHIEVE                     1 (  0.1%)\n",
      "DO_FINE                                 1 (  0.1%)\n",
      "DO_BETTER_JOB_OF_PHOSPHORUS_UPTAKE          1 (  0.1%)\n",
      "GOING_UP                                1 (  0.1%)\n",
      "HAS_LOWER                               1 (  0.1%)\n",
      "IS_MORE_ATTRACTIVE_TO                   1 (  0.1%)\n",
      "EXHIBITED_ON                            1 (  0.1%)\n",
      "YELLOWING_IS_ON                         1 (  0.1%)\n",
      "TENDS_TO_BE_MORE_FIBROUS                1 (  0.1%)\n",
      "HAS_A_HIGH_DEMAND_FOR                   1 (  0.1%)\n",
      "REMOVES_APPROXIMATELY                   1 (  0.1%)\n",
      "MUST_BE_ABLE_TO_UPTAKE_NEARLY           1 (  0.1%)\n",
      "COMPETES_WITH                           1 (  0.1%)\n",
      "GROWERS                                 1 (  0.1%)\n",
      "CONTAINING                              1 (  0.1%)\n",
      "TAKEN_UP_INTO_PLANTS                    1 (  0.1%)\n",
      "CONVERTED_INTO                          1 (  0.1%)\n",
      "LOOK                                    1 (  0.1%)\n",
      "TEND_TO_SHOW                            1 (  0.1%)\n",
      "RESTRICTS                               1 (  0.1%)\n",
      "SHOWS_UP_FIRST                          1 (  0.1%)\n",
      "MAY_RESULT_IN                           1 (  0.1%)\n",
      "LOOKS_LIKE                              1 (  0.1%)\n",
      "SIMILAR_TO                              1 (  0.1%)\n",
      "SHOWN_BY                                1 (  0.1%)\n",
      "MORE_PREVALENT_IN                       1 (  0.1%)\n",
      "ENHANCE                                 1 (  0.1%)\n",
      "APPROACHES_7_AND_GOES_HIGHER            1 (  0.1%)\n",
      "LOWER_PH_LEVELS                         1 (  0.1%)\n",
      "PH_LEVELS_OF_5_AND_BELOW                1 (  0.1%)\n",
      "MOVED_PRIMARILY                         1 (  0.1%)\n",
      "REDUCES                                 1 (  0.1%)\n",
      "SHOW                                    1 (  0.1%)\n",
      "IMPROVE                                 1 (  0.1%)\n",
      "DOES_LITTLE                             1 (  0.1%)\n",
      "VISUALLY_SHOW_UP                        1 (  0.1%)\n",
      "FOUND_IN                                1 (  0.1%)\n",
      "NOT_EASILY_TRANSLOCATED                 1 (  0.1%)\n",
      "SHOW_UP_FIRST                           1 (  0.1%)\n",
      "RESULT_FROM                             1 (  0.1%)\n",
      "INHERENTLY_LOW_IN                       1 (  0.1%)\n",
      "OFTEN_SHOW                              1 (  0.1%)\n",
      "IMPACT                                  1 (  0.1%)\n",
      "SUBSTANTIALLY_REDUCE_AVAILABILITY_OF          1 (  0.1%)\n",
      "HAS_BEEN_SHOWN_TO                       1 (  0.1%)\n",
      "IMPROVES                                1 (  0.1%)\n",
      "CAN_HAVE_DETRIMENTAL_REACTION           1 (  0.1%)\n",
      "SENSITIVE_TO                            1 (  0.1%)\n",
      "INTERCEPTED_BY                          1 (  0.1%)\n",
      "EXHIBIT                                 1 (  0.1%)\n",
      "DEMONSTRATE                             1 (  0.1%)\n",
      "TEND_TO_LOOK_LIKE                       1 (  0.1%)\n",
      "MAY_BE_AN_INDICATION_OF                 1 (  0.1%)\n",
      "SHOWS_DEFICIENCY_MOST_FREQUENTLY          1 (  0.1%)\n",
      "DEMONSTRATE_A_HIGH_ACCUMULATION_OF          1 (  0.1%)\n",
      "IS_THE_BEST_WAY_TO_SUPPLY               1 (  0.1%)\n",
      "NOT_A_PROBLEM_FOR_PLANT_GROWTH          1 (  0.1%)\n",
      "INCREASES_THE_SOLUBILITY_OF_LIME          1 (  0.1%)\n",
      "CAUSES_17_PERCENT_VARIABLE              1 (  0.1%)\n",
      "REFERS_TO                               1 (  0.1%)\n",
      "DRIVEN_BY                               1 (  0.1%)\n",
      "WRITES_ABOUT                            1 (  0.1%)\n",
      "WAS_DEVELOPED_BY                        1 (  0.1%)\n",
      "FOCUSES_ON                              1 (  0.1%)\n",
      "IS_A_LIQUID                             1 (  0.1%)\n",
      "INCREASES_PLANTS_GROWTH                 1 (  0.1%)\n",
      "BREWES                                  1 (  0.1%)\n",
      "MAKES                                   1 (  0.1%)\n",
      "HAS_GREATER_RESISTANCE_TO_SEALING          1 (  0.1%)\n",
      "HAS_LOWER_RESISTANCE_TO_SEALING          1 (  0.1%)\n",
      "SHOWS_MODERATE_RESISTANCE_TO_SEALING          1 (  0.1%)\n",
      "CAUSES_DISPERSION_OF_SOIL_PARTICLES          1 (  0.1%)\n",
      "PRESERVES_SOIL_STRUCTURE                1 (  0.1%)\n",
      "--------------------------------------------------\n",
      "Total Knowledge Relationships: 729\n",
      "\n",
      "Sample Knowledge Triplets:\n",
      "(cannabis_plants) --[OPTIMAL_PH_IS]--> (6.8-6.9)\n",
      "(cannabis_plants) --[MENTIONED_IN]--> (None)\n",
      "(6.8-6.9) --[MENTIONED_IN]--> (None)\n",
      "(pH) --[AFFECTS]--> (cannabis_plants)\n",
      "(pH) --[MENTIONED_IN]--> (None)\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"asd@123qwe\"))\n",
    "database = \"test\"\n",
    "try:\n",
    "    with driver.session(database=database) as session:\n",
    "        # Count knowledge relationships (excluding CONTAINS)\n",
    "        result = session.run(\"\"\"\n",
    "            MATCH ()-[r]->()\n",
    "            WHERE type(r) <> 'CONTAINS'\n",
    "            WITH type(r) as rel_type, count(r) as count\n",
    "            RETURN rel_type, count\n",
    "            ORDER BY count DESC\n",
    "\n",
    "        \"\"\")\n",
    "\n",
    "        print(\"Knowledge Relationships\")\n",
    "        print(\"=\" * 50)\n",
    "        print(f\"{'Relationship Type':<30} {'Count':>10}\")\n",
    "        print(\"-\" * 50)\n",
    "\n",
    "        relationships = [(record[\"rel_type\"], record[\"count\"]) for record in result]\n",
    "        knowledge_rels = sum(count for _, count in relationships)\n",
    "\n",
    "        for rel_type, count in relationships:\n",
    "            percentage = (count / knowledge_rels) * 100\n",
    "            print(f\"{rel_type:<30} {count:>10} ({percentage:>5.1f}%)\")\n",
    "\n",
    "        print(\"-\" * 50)\n",
    "        print(f\"Total Knowledge Relationships: {knowledge_rels}\")\n",
    "\n",
    "        # Sample some actual triplets\n",
    "        print(\"\\nSample Knowledge Triplets:\")\n",
    "        result = session.run(\"\"\"\n",
    "            MATCH (a)-[r]->(b)\n",
    "            WHERE type(r) <> 'CONTAINS'\n",
    "            RETURN a.name as subject, type(r) as relation, b.name as object\n",
    "            LIMIT 5\n",
    "        \"\"\")\n",
    "\n",
    "        for record in result:\n",
    "            print(f\"({record['subject']}) --[{record['relation']}]--> ({record['object']})\")\n",
    "\n",
    "finally:\n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "data = [\n",
    "    {\n",
    "        'Subject': 'soil_testing',\n",
    "        'Relationship': 'IS_IMPORTANT_FOR',\n",
    "        'Object': 'cannabis_growing',\n",
    "        'Source': 'Soil Testing 101- How To Properly Take A Soil Sample.md'\n",
    "    },\n",
    "    {\n",
    "        'Subject': 'Small_pots',\n",
    "        'Relationship': 'MAY_CAUSE',\n",
    "        'Object': 'running_out_of_nutrients',\n",
    "        'Source': None\n",
    "    },\n",
    "    {\n",
    "        'Subject': 'website_at_kisorganics_com',\n",
    "        'Relationship': 'OFFERS',\n",
    "        'Object': 'soil_testing_and_consultations',\n",
    "        'Source': 'Soil Testing 101- How To Properly Take A Soil Sample.md'\n",
    "    },\n",
    "    {\n",
    "        'Subject': 'Organic_options',\n",
    "        'Relationship': 'APPLIES_TO',\n",
    "        'Object': 'nutrient_deficiency_in_plants',\n",
    "        'Source': None\n",
    "    },\n",
    "    {\n",
    "        'Subject': 'soil_sample',\n",
    "        'Relationship': 'NEEDS',\n",
    "        'Object': 'a_plastic_ziploc_bag',\n",
    "        'Source': 'Soil Testing 101- How To Properly Take A Soil Sample.md'\n",
    "    }\n",
    "]\n",
    "\n",
    "df = pd.DataFrame(data)\n",
    "\n",
    "print(\"Knowledge Graph Triplets:\")\n",
    "print(df)\n",
    "\n",
    "print(\"\\nBasic Statistics:\")\n",
    "print(f\"Number of triplets with source: {df['Source'].notna().sum()}\")\n",
    "print(f\"Number of triplets without source: {df['Source'].isna().sum()}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
